dev/Server/test/stress/config.yml
config:
  target: "https://localhost:3333/command"
  http:
    timeout: 5
  phases:
    - duration: 300
      arrivalRate: 1
      rampTo: 1000
      name: stress_phase
  payload:
    path: "users.csv"
    fields:
      - "username"
    order: sequence
    skipHeader: false

scenarios:
  - name: "stress"
    flow:
      - get:
          url: "/enter"
          capture:
            json: "$.userId"
            as: userId
      - think: 2
      - post:
          url: "/register"
          json:
            username: "{{ username }}"
            password: "badadeedadoo"
            age: 25
      - think: 2
      - post:
          url: "/login"
          json:
            userId: "{{ userId }}"
            username: "{{ username }}"
            password: "badadeedadoo"
          capture:
            json: "$.userId"
            as: userId
      - think: 2
      - post:
          url: "/logout"
          json:
            userId: "{{ userId }}"
      # - post:
      #     url: "/exit"
      #     json:
      #       userId: "{{ userId }}"